Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
tions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::127214202110:role/svep_backend_ec2_references_instance_role",
            ]
        }
    }

  # module.svep[0].aws_api_gateway_authorizer.svep_user_pool_authorizer will be created
  + resource "aws_api_gateway_authorizer" "svep_user_pool_authorizer" {
      + arn                              = (known after apply)
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "sbeacon-userpool-authorizer"
      + provider_arns                    = (known after apply)
      + rest_api_id                      = "49hervuih0"
      + type                             = "COGNITO_USER_POOLS"
    }

  # module.svep[0].aws_api_gateway_deployment.VPApi will be created
  + resource "aws_api_gateway_deployment" "VPApi" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "49hervuih0"
      + triggers      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.results-get will be created
  + resource "aws_api_gateway_integration" "results-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "dkhqay"
      + rest_api_id             = "49hervuih0"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.submit-patch will be created
  + resource "aws_api_gateway_integration" "submit-patch" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PATCH"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "ww21x7"
      + rest_api_id             = "49hervuih0"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.submit-post will be created
  + resource "aws_api_gateway_integration" "submit-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "ww21x7"
      + rest_api_id             = "49hervuih0"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-patch will be created
  + resource "aws_api_gateway_integration" "vcfstats-patch" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PATCH"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "g3m5jp"
      + rest_api_id             = "49hervuih0"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-post will be created
  + resource "aws_api_gateway_integration" "vcfstats-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "g3m5jp"
      + rest_api_id             = "49hervuih0"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration_response.results-get will be created
  + resource "aws_api_gateway_integration_response" "results-get" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "dkhqay"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "49hervuih0"
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-patch will be created
  + resource "aws_api_gateway_integration_response" "submit-patch" {
      + http_method        = "PATCH"
      + id                 = (known after apply)
      + resource_id        = "ww21x7"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "49hervuih0"
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-post will be created
  + resource "aws_api_gateway_integration_response" "submit-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "ww21x7"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "49hervuih0"
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-patch will be created
  + resource "aws_api_gateway_integration_response" "vcfstats-patch" {
      + http_method        = "PATCH"
      + id                 = (known after apply)
      + resource_id        = "g3m5jp"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "49hervuih0"
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-post will be created
  + resource "aws_api_gateway_integration_response" "vcfstats-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "g3m5jp"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "49hervuih0"
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_method.results-get will be created
  + resource "aws_api_gateway_method" "results-get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "dkhqay"
      + rest_api_id      = "49hervuih0"
    }

  # module.svep[0].aws_api_gateway_method.submit-patch will be created
  + resource "aws_api_gateway_method" "submit-patch" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "PATCH"
      + id               = (known after apply)
      + resource_id      = "ww21x7"
      + rest_api_id      = "49hervuih0"
    }

  # module.svep[0].aws_api_gateway_method.submit-post will be created
  + resource "aws_api_gateway_method" "submit-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "ww21x7"
      + rest_api_id      = "49hervuih0"
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-patch will be created
  + resource "aws_api_gateway_method" "vcfstats-patch" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "PATCH"
      + id               = (known after apply)
      + resource_id      = "g3m5jp"
      + rest_api_id      = "49hervuih0"
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-post will be created
  + resource "aws_api_gateway_method" "vcfstats-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "g3m5jp"
      + rest_api_id      = "49hervuih0"
    }

  # module.svep[0].aws_api_gateway_method_response.results-get will be created
  + resource "aws_api_gateway_method_response" "results-get" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "dkhqay"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "49hervuih0"
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.submit-patch will be created
  + resource "aws_api_gateway_method_response" "submit-patch" {
      + http_method         = "PATCH"
      + id                  = (known after apply)
      + resource_id         = "ww21x7"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "49hervuih0"
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.submit-post will be created
  + resource "aws_api_gateway_method_response" "submit-post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "ww21x7"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "49hervuih0"
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.vcfstats-patch will be created
  + resource "aws_api_gateway_method_response" "vcfstats-patch" {
      + http_method         = "PATCH"
      + id                  = (known after apply)
      + resource_id         = "g3m5jp"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "49hervuih0"
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.vcfstats-post will be created
  + resource "aws_api_gateway_method_response" "vcfstats-post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "g3m5jp"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "49hervuih0"
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_settings.VPApi will be created
  + resource "aws_api_gateway_method_settings" "VPApi" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "49hervuih0"
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = (known after apply)
          + metrics_enabled                            = (known after apply)
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 1000
          + throttling_rate_limit                      = 100
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.svep[0].aws_api_gateway_stage.VPApi will be created
  + resource "aws_api_gateway_stage" "VPApi" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "49hervuih0"
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.svep[0].aws_cloudfront_cache_policy.api will be created
  + resource "aws_cloudfront_cache_policy" "api" {
      + arn         = (known after apply)
      + default_ttl = 0
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 0
      + min_ttl     = 0
      + name        = "svep-backend-api"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "none"
            }
          + headers_config {
              + header_behavior = "none"
            }
          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # module.svep[0].aws_cloudfront_distribution.api_distribution will be created
  + resource "aws_cloudfront_distribution" "api_distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "svep-backend-api"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = (known after apply)

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = (known after apply)
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = 0
          + max_ttl                  = 0
          + min_ttl                  = 0
          + origin_request_policy_id = (known after apply)
          + target_origin_id         = "svep-backend-api"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "https-only"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "svep-backend-api"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.svep[0].aws_cloudfront_origin_request_policy.api will be created
  + resource "aws_cloudfront_origin_request_policy" "api" {
      + arn  = (known after apply)
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "svep-backend-api"

      + cookies_config {
          + cookie_behavior = "none"
        }

      + headers_config {
          + header_behavior = "allExcept"

          + headers {
              + items = [
                  + "Host",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "all"
        }
    }

  # module.svep[0].aws_cloudwatch_event_rule.update_references_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "update_references_trigger" {
        id                  = "svep_update_references_trigger"
        name                = "svep_update_references_trigger"
      ~ tags                = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all            = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_cloudwatch_event_target.update_references_trigger will be created
  + resource "aws_cloudwatch_event_target" "update_references_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "svep_update_references_trigger"
      + target_id      = "lambda-updateReferenceFiles"
    }

  # module.svep[0].aws_dynamodb_table.svep_references will be created
  + resource "aws_dynamodb_table" "svep_references" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "svep-references"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.svep[0].aws_iam_role_policy.ec2_references_policy will be created
  + resource "aws_iam_role_policy" "ec2_references_policy" {
      + id          = (known after apply)
      + name        = "svep_backend_ec2_references_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep_backend_ec2_references_instance_role"
    }

  # module.svep[0].aws_lambda_event_source_mapping.clinic_jobs_stream_event_source will be created
  + resource "aws_lambda_event_source_mapping" "clinic_jobs_stream_event_source" {
      + arn                           = (known after apply)
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = "svep-backend-clearTempAndRegions"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + starting_position             = "LATEST"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + filter_criteria {
          + filter {
              + pattern = jsonencode(
                    {
                      + eventName = [
                          + "MODIFY",
                        ]
                    }
                )
            }
        }

      + self_managed_kafka_event_source_config (known after apply)
    }

  # module.svep[0].aws_lambda_function_recursion_config.concat_starter_recursion will be created
  + resource "aws_lambda_function_recursion_config" "concat_starter_recursion" {
      + function_name  = "svep-backend-concatStarter"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.create_pages_recursion will be created
  + resource "aws_lambda_function_recursion_config" "create_pages_recursion" {
      + function_name  = "svep-backend-createPages"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.init_query_recursion will be created
  + resource "aws_lambda_function_recursion_config" "init_query_recursion" {
      + function_name  = "svep-backend-initQuery"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.plugin_consequence_recursion will be created
  + resource "aws_lambda_function_recursion_config" "plugin_consequence_recursion" {
      + function_name  = "svep-backend-pluginConsequence"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.query_gtf_recursion will be created
  + resource "aws_lambda_function_recursion_config" "query_gtf_recursion" {
      + function_name  = "svep-backend-queryGTF"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.query_vcf_recursion will be created
  + resource "aws_lambda_function_recursion_config" "query_vcf_recursion" {
      + function_name  = "svep-backend-queryVCF"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_function_recursion_config.update_reference_files_recursion will be created
  + resource "aws_lambda_function_recursion_config" "update_reference_files_recursion" {
      + function_name  = "svep-backend-updateReferenceFiles"
      + recursive_loop = "Allow"
    }

  # module.svep[0].aws_lambda_permission.cloudwatch_update_reference_files_invoke_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_update_reference_files_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:ap-southeast-3:127214202110:rule/svep_update_references_trigger"
      + statement_id        = "CloudwatchUpdateReferenceFilesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.concat_invoke_permission will be created
  + resource "aws_lambda_permission" "concat_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-concat"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concat"
      + statement_id        = "SNSConcatAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.concat_pages_invoke_permission will be created
  + resource "aws_lambda_permission" "concat_pages_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-concatPages"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatPages"
      + statement_id        = "SNSConcatPagesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.concat_starter_invoke_permission will be created
  + resource "aws_lambda_permission" "concat_starter_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-concatStarter"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatStarter"
      + statement_id        = "SNSConcatStarterAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.create_pages_invoke_permission will be created
  + resource "aws_lambda_permission" "create_pages_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-createPages"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-createPages"
      + statement_id        = "SNSCreatePagesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.formatOutput_invoke_permission will be created
  + resource "aws_lambda_permission" "formatOutput_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-formatOutput"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-formatOutput"
      + statement_id        = "SNSformatOutputAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.get_results_invoke_permission will be created
  + resource "aws_lambda_permission" "get_results_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-getResultsURL"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:127214202110:49hervuih0/*/*/results"
      + statement_id        = "APIGetResultsAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.init_query_invoke_permission will be created
  + resource "aws_lambda_permission" "init_query_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-initQuery"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:127214202110:49hervuih0/*/*/submit"
      + statement_id        = "APIInitQueryAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_clinvar_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_clinvar_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginClinvar"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginClinvar"
      + statement_id        = "SNSPluginClinvarAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_consequence_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_consequence_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginConsequence"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginConsequence"
      + statement_id        = "SNSPluginConsequenceAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_plugin_gnomad_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginGnomad"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginGnomad"
      + statement_id        = "SNSPluginGnomadAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_send_job_email_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_send_job_email_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-sendJobEmail"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
      + statement_id        = "SNSSendJobEmailAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.query_gtf_invoke_permission will be created
  + resource "aws_lambda_permission" "query_gtf_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-queryGTF"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF"
      + statement_id        = "SNSQueryGTFAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.query_vcf_invoke_permission will be created
  + resource "aws_lambda_permission" "query_vcf_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-queryVCF"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCF"
      + statement_id        = "SNSQueryVCFAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.query_vcf_submit_invoke_permission will be created
  + resource "aws_lambda_permission" "query_vcf_submit_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-queryVCFsubmit"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCFsubmit"
      + statement_id        = "SNSQueryVCFSubmitAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.sns_update_reference_files_invoke_permission will be created
  + resource "aws_lambda_permission" "sns_update_reference_files_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-updateReferenceFiles"
      + statement_id        = "SNSUpdateReferenceFilesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.vcfstats_graphic_invoke_permission will be created
  + resource "aws_lambda_permission" "vcfstats_graphic_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-qcFigures"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:127214202110:49hervuih0/*/*/vcfstats"
      + statement_id        = "APIVcfstatsAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_sns_topic.concat will be updated in-place
  ~ resource "aws_sns_topic" "concat" {
        id                                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concat"
        name                                     = "svep-backend-concat"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (29 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.concatPages will be updated in-place
  ~ resource "aws_sns_topic" "concatPages" {
        id                                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatPages"
        name                                     = "svep-backend-concatPages"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (29 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.concatStarter will be updated in-place
  ~ resource "aws_sns_topic" "concatStarter" {
        id                                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatStarter"
        name                                     = "svep-backend-concatStarter"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (29 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.createPages will be updated in-place
  ~ resource "aws_sns_topic" "createPages" {
        id                                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-createPages"
        name                                     = "svep-backend-createPages"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (29 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.pluginClinvar will be updated in-place
  ~ resource "aws_sns_topic" "pluginClinvar" {
        id                                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginClinvar"
        name                                     = "svep-backend-pluginClinvar"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (29 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.pluginConsequence will be updated in-place
  ~ resource "aws_sns_topic" "pluginConsequence" {
        id                                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginConsequence"
        name                                     = "svep-backend-pluginConsequence"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (29 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.queryGTF will be updated in-place
  ~ resource "aws_sns_topic" "queryGTF" {
        id                                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF"
        name                                     = "svep-backend-queryGTF"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (29 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.queryVCF will be updated in-place
  ~ resource "aws_sns_topic" "queryVCF" {
        id                                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCF"
        name                                     = "svep-backend-queryVCF"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (29 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.queryVCFsubmit will be updated in-place
  ~ resource "aws_sns_topic" "queryVCFsubmit" {
        id                                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCFsubmit"
        name                                     = "svep-backend-queryVCFsubmit"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (29 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.sendJobEmail will be updated in-place
  ~ resource "aws_sns_topic" "sendJobEmail" {
        id                                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
        name                                     = "svep-backend-sendJobEmail"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (29 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic.updateReferenceFiles will be updated in-place
  ~ resource "aws_sns_topic" "updateReferenceFiles" {
        id                                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-updateReferenceFiles"
        name                                     = "svep-backend-updateReferenceFiles"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          - "Environment" = "STAGING" -> null
          - "NAME"        = "svep-backend" -> null
          - "Owner"       = "GXC" -> null
        }
        # (29 unchanged attributes hidden)
    }

  # module.svep[0].aws_sns_topic_subscription.concat will be created
  + resource "aws_sns_topic_subscription" "concat" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concat"
    }

  # module.svep[0].aws_sns_topic_subscription.concatPages will be created
  + resource "aws_sns_topic_subscription" "concatPages" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatPages"
    }

  # module.svep[0].aws_sns_topic_subscription.concatStarter will be created
  + resource "aws_sns_topic_subscription" "concatStarter" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatStarter"
    }

  # module.svep[0].aws_sns_topic_subscription.createPages will be created
  + resource "aws_sns_topic_subscription" "createPages" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-createPages"
    }

  # module.svep[0].aws_sns_topic_subscription.formatOutput will be created
  + resource "aws_sns_topic_subscription" "formatOutput" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-formatOutput"
    }

  # module.svep[0].aws_sns_topic_subscription.pluginClinvar will be created
  + resource "aws_sns_topic_subscription" "pluginClinvar" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginClinvar"
    }

  # module.svep[0].aws_sns_topic_subscription.pluginConsequence will be created
  + resource "aws_sns_topic_subscription" "pluginConsequence" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginConsequence"
    }

  # module.svep[0].aws_sns_topic_subscription.pluginGnomad will be created
  + resource "aws_sns_topic_subscription" "pluginGnomad" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginGnomad"
    }

  # module.svep[0].aws_sns_topic_subscription.queryGTF will be created
  + resource "aws_sns_topic_subscription" "queryGTF" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF"
    }

  # module.svep[0].aws_sns_topic_subscription.queryVCF will be created
  + resource "aws_sns_topic_subscription" "queryVCF" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCF"
    }

  # module.svep[0].aws_sns_topic_subscription.queryVCFsubmit will be created
  + resource "aws_sns_topic_subscription" "queryVCFsubmit" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCFsubmit"
    }

  # module.svep[0].aws_sns_topic_subscription.sendJobEmail will be created
  + resource "aws_sns_topic_subscription" "sendJobEmail" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail"
    }

  # module.svep[0].aws_sns_topic_subscription.updateReferenceFiles will be created
  + resource "aws_sns_topic_subscription" "updateReferenceFiles" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-updateReferenceFiles"
    }

  # module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_access_from_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::webgui-bucket-20250524134912733100000001/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.webgui.data.external.build will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build" {
      + id          = (known after apply)
      + program     = [
          + "python",
          + "build_and_hash.py",
        ]
      + query       = {
          + "api_endpoint_clinic"     = (known after apply)
          + "api_endpoint_sbeacon"    = (known after apply)
          + "base_range"              = "5000"
          + "build_command"           = "./node_modules/.bin/ng build --configuration production --subresource-integrity"
          + "build_destiation"        = "../webapp/dist/beacon-v2-ui/browser/"
          + "clinic_mode"             = "svep"
          + "data_portal_bucket"      = "gasi-dataportal-20250524134911180600000001"
          + "hub_name"                = "RSCM"
          + "identity_pool_id"        = (known after apply)
          + "install_command"         = "pnpm install"
          + "region"                  = "ap-southeast-3"
          + "user_pool_id"            = (known after apply)
          + "user_pool_web_client_id" = (known after apply)
          + "webapp_dir"              = "../webapp/"
        }
      + result      = (known after apply)
      + working_dir = "webgui/terraform-aws"
    }

  # module.webgui.aws_cloudfront_distribution.bui-s3-distribution will be created
  + resource "aws_cloudfront_distribution" "bui-s3-distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Distribution for BeaconUI"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2and3"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_200"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "uat"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "gaspi"
        }
      + tags_all                        = {
          + "Environment" = "uat"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "gaspi"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = (known after apply)

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "webgui-s3-origin-id"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "webgui-bucket-20250524134912733100000001.s3.ap-southeast-3.amazonaws.com"
          + origin_access_control_id = (known after apply)
          + origin_id                = "webgui-s3-origin-id"
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.webgui.aws_cloudfront_origin_access_control.bui-s3-distribution will be created
  + resource "aws_cloudfront_origin_access_control" "bui-s3-distribution" {
      + arn                               = (known after apply)
      + description                       = "Policy for BeaconUI"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "webgui-access-control"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy will be created
  + resource "aws_cloudfront_response_headers_policy" "bui-security-headers-policy" {
      + arn  = (known after apply)
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "bui-security-headers-policy"

      + custom_headers_config {
          + items {
              + header   = "Permissions-Policy"
              + override = true
              + value    = "geolocation=(), microphone=(), camera=(), payment=(), accelerometer=(), fullscreen=*"
            }
        }

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = (known after apply)
              + override                = true
            }
          + content_type_options {
              + override = true
            }
          + frame_options {
              + frame_option = "DENY"
              + override     = true
            }
          + referrer_policy {
              + override        = true
              + referrer_policy = "no-referrer"
            }
          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }
          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront will be created
  + resource "aws_s3_bucket_policy" "s3_access_from_cloudfront" {
      + bucket = "webgui-bucket-20250524134912733100000001"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url will be created
  + resource "aws_ssm_parameter" "bui-ssm-beacon-ui-url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "bui-ssm-beacon-ui-url"
      + tags           = {
          + "Environment" = "uat"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "gaspi"
        }
      + tags_all       = {
          + "Environment" = "uat"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "gaspi"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.webgui.null_resource.cloudfront-invalidate will be created
  + resource "null_resource" "cloudfront-invalidate" {
      + id       = (known after apply)
      + triggers = {
          + "compiled_code_hash" = (known after apply)
        }
    }

  # module.webgui.null_resource.s3-upload will be created
  + resource "null_resource" "s3-upload" {
      + id       = (known after apply)
      + triggers = {
          + "build_file_hash"    = "892f738d6a75c9a463120bba9ae1147b02f43b74"
          + "compiled_code_hash" = (known after apply)
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.